using System;
using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

#pragma warning disable CA1814 // Prefer jagged arrays over multidimensional

namespace ATKApplication.Migrations
{
    /// <inheritdoc />
    public partial class FixedInterAgencyCoopAndETC : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("00a40677-d7a0-4b53-a064-142595074c5c"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("03e94dd6-2411-4ad5-83fb-f553031351c7"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("0824d6ff-5211-43d6-9280-687429d0056f"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("0aca1e3f-50d4-4c01-a96a-f6ac326cdf8c"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("0b4ffa3a-fd7d-405c-8725-0c8110ee556f"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("1082e7e1-b00c-4f51-8a5f-2410a1e6d645"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("14075b2f-391c-4922-9d4e-866720c88c36"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("1634caee-6481-466c-acb6-2b6b10933d47"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("1d9ee667-b6a6-4ed7-afa9-f1b8f814bfc0"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("2b21a8d2-f546-4d9f-8e6d-7bc85d24887d"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("2e27cd01-8bfd-47ce-99bb-6a6fcdfc2880"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("311bcaab-cc06-4af6-b500-5c87ebdd661f"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("39c752e9-f6fe-49a8-8cdc-bed6754fb4d4"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("3ee60fd7-8300-47b5-a431-cc24d308580b"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("3fc868c4-047a-4440-9190-841a99fb7fd5"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("445f9e4d-2268-41a9-9688-7b2e09c63b4b"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("4bd2c26c-db5c-435f-aea4-f4d7db46b9d9"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("4d26271a-f367-48f8-b12f-5664378e9dbb"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("508c8221-0cf1-47a7-ae6a-dfa361f0ecdb"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("516d654c-afc5-4558-afc0-92658fa6aa8f"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("568d3452-7611-4995-a98a-09ee4b14c011"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("5bdf4da1-731f-415c-8ce6-4f07d9397656"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("5e0708f7-2fb3-43c2-8c69-2d987cca64ce"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("6a384820-be35-4759-bc31-6d52854a3e0f"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("6dbd50b7-8b71-4033-bace-0c898193538e"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("6f57905d-15fd-4245-80cb-27f67bfd9858"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("78472eda-0c92-4ba1-bcb2-12978a5866c7"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("7a96ac16-46c9-49d8-9b96-c8186cd85c65"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("7fd2e75c-c92e-4896-9cab-07c3e4cc2374"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("80d05323-db9b-46d3-aa89-c707978c4156"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("81a911e1-71b9-4b03-afb7-b1ab0f6f3b1a"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("881365a9-a9c2-49da-831e-467bcdb27fa2"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("88d8e4cb-3917-4b63-ab47-4f091b2dc923"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("8ac16832-534f-4b02-b64d-3a0145de24cd"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("8bd402ce-9e0a-4f36-8b6e-f0c9532a8774"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("944a8a7d-c9f1-45fe-b735-1bc366fea30c"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("a42ad712-a24f-4bc3-9c50-c66d0ac53840"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("a5629e19-8055-49aa-acbe-17d139bd88ca"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("a852b374-1140-49f9-af96-062951be3591"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("aa15b307-248c-4822-bd5f-bab3de217bca"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("aad95e2a-0836-4d3b-a648-03a313554b21"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("b093d3c8-f35e-42ee-a894-f0725ca1b1a1"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("b8f3a363-bce8-49bc-89ca-272ea01260d3"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("c51b70c3-5ad9-4100-b74e-f0e50c14cd68"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("ca86782e-8488-4943-87af-f0e661325032"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("dda72c7e-8c48-4569-a256-cce8b18f5032"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("e144b255-58b6-471c-b553-ebf9c39568e8"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("e34472ee-3b48-4e7f-8523-5981704d0a03"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("f1f68ffe-435e-4ded-90e1-b9646bdf88a1"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("f75a22fc-809a-4eb3-bdbc-4c34b1fc202e"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("fe010915-4641-4e75-8b50-67926468cd43"));

            migrationBuilder.DropColumn(
                name: "Type",
                table: "InterAgencyCooperations");

            migrationBuilder.AddColumn<string>(
                name: "Role",
                table: "InterAgencyCooperations",
                type: "text",
                nullable: false,
                defaultValue: "");

            migrationBuilder.InsertData(
                table: "Themes",
                columns: new[] { "Id", "Code", "Description", "Form" },
                values: new object[,]
                {
                    { new Guid("0176009d-e13f-4230-b4af-42b5b040ec70"), "3.3.2", "Привлечение деятельно раскаявшихся и отказавшихся от участия в террористической деятельности лиц к проведению профилактической работы, включая создание антитеррористического контента", 0 },
                    { new Guid("04e1b300-6327-4dd9-a713-d628b34a2a41"), "2.6", "Привлечение жителей новых субъектов Российской Федерации, прибывших в автономный округ, к волонтерской и иной социально полезной деятельности, в том числе антитеррористической направленности, способствующей привитию им традиционных российских духовно-нравственных ценностей", 1 },
                    { new Guid("05433cb1-cbf1-4f67-9328-26e8f96eef07"), "5.3", "Описание темы 5.3", 2 },
                    { new Guid("0bc37a8e-ab7d-4b97-b898-4157b772993d"), "5.6", "Оказание государственной и муниципальной поддержки некоммерческим, общественным организациям, деятельность которых направлена на привлечение обучающихся и молодежи, состоящей на различных формах учета, к реализации социально значимых, культурно-просветительских, гуманитарных, спортивных проектов, способствующих формированию антитеррористического мировоззрения", 1 },
                    { new Guid("120fb6a7-d16d-4237-b547-96788609fbe7"), "1.2.1", "Проведение общественно-политических, воспитательных, просветительских, культурных, досуговых и спортивных мероприятий (круглые столы, акции памяти, встречи с лицами, отличившимися в борьбе с терроризмом и неонацизмом, профилактические беседы, кинопоказы, выставки, тематические викторины, спортивные турниры и др.) (далее – мероприятия), в содержание которых включена антитеррористическая тематика, с привлечением лидеров общественного мнения , общественных деятелей, представителей традиционных религиозных конфессий, общественных и социально ориентированных некоммерческих организаций, детских и молодежных движений (обществ, проектов)", 1 },
                    { new Guid("2a21fea5-a310-4739-944c-f6515211768d"), "1.3.4", "Организация проведения студентами исследований и реализации творческих (художественных, театральных, журналистских, просветительских) проектов антитеррористического содержания (далее – проект), обеспечение участия их авторов в межвузовских, региональных и всероссийских конкурсах", 1 },
                    { new Guid("33da1420-da46-4361-bdbf-2b39f259efc3"), "3.1.1", "Проведение мероприятий по формированию антитеррористического мировоззрения среди лиц, осужденных за совершение преступлений террористической направленности", 0 },
                    { new Guid("3c40301b-1a29-4da0-9c89-f797d3cfe7da"), "5.2", "Проведение региональных и муниципальных обучающих мероприятий (конференции, форумы, семинары, «круглые столы», и др.) с последующим освещением их результатов на официальных сайтах, в социальных сетях и средствах массовой информации", 1 },
                    { new Guid("3d01ec36-ed5a-4713-bdb1-517b61370df3"), "1.6", "Анализ психологического климата в образовательных организациях, активности виртуальных деструктивных сообществ, динамики насильственных проявлений среди несовершеннолетних, по результатам которых: принимать меры, направленные на повышение качества организации и реализации воспитательных и профилактических мероприятий в конкретной образовательной организации, в том числе с привлечением учреждений молодежной политики, культуры и спорта; информировать Аппарат АТК автономного округа о принятых мерах", 0 },
                    { new Guid("3f3af9e5-f945-4d05-87f8-6fcf18b9d04b"), "4.7", "Подготовка и распространение тематических материалов, разъясняющих несостоятельность доводов и фактов, оправдывающих террористическую деятельность, совершаемую украинскими националистами, неонацистами и их пособниками", 5 },
                    { new Guid("472de934-4c7a-43fc-a5e2-c4c73b8248db"), "5.1.2", "Описание темы 5.1.2", 0 },
                    { new Guid("474b23bf-309c-4dfb-985a-880aaeb521ce"), "5.1.3", "Описание темы 5.1.3", 0 },
                    { new Guid("4862344f-8d3e-43f4-a3d6-9e17f7485ee8"), "3.1.2", "Привлечение психологов, членов семей, представителей общественных и религиозных организаций к проведению с лицами, осужденными за совершение преступлений террористической направленности, информационно-просветительских и воспитательных мероприятий по разъяснению традиционных российских духовно-нравственных ценностей, общественной опасности терроризма, бесперспективности террористических методов борьбы, правовой и моральной ответственности за участие в деятельности террористических организаций", 0 },
                    { new Guid("4ce53ec5-254b-4c95-8bee-366c352e23d2"), "3.2.2", "Проведение мероприятий информационно-разъяснительного характера с лицами, отбывшими наказание за участие в террористической деятельности", 2 },
                    { new Guid("535697ef-d5e9-40f4-b6d8-b9c8af92c583"), "3.5", "Индивидуальные профилактические мероприятия в отношении подростков и детей, в том числе с признаками травмированной психики, находившихся под влиянием украинских националистических и неонацистских структур, а также проявляющих в социальных сетях и мессенджерах активный интерес к террористическому и деструктивному контенту радикальной, насильственной и суицидальной направленности", 2 },
                    { new Guid("585a30de-0d0f-48ee-94b5-1e887cf31b1a"), "4.1.3", "Создание и обеспечение функционирования электронного каталога антитеррористических материалов (текстовых, графических, аудио и видео) с предоставлением к нему свободного доступа прежде всего для использования при проведении общепрофилактических, адресных, индивидуальных и информационно-пропагандистских мероприятий", 1 },
                    { new Guid("5c4ebf6f-5cb8-43a0-87c5-294c302d0a35"), "4.3", "Оказание в условиях государственной (грантовой) поддержки проектов создания материалов, нацеленных на формирование у жителей автономного округа антитеррористического мировоззрения (теле- и радиопередач, игровых и неигровых фильмов, театральных постановок, выставок, буклетов, книжных изданий), распространяемых по наиболее популярным у населения, прежде всего молодежи, информационным каналам (с привлечением региональных и местных средств массовой информации, социально ориентированных некоммерческих организаций, религиозных и общественных организаций, продюсерских центров, творческих объединений и киностудий, администраторов популярных каналов в социальных сетях и мессенджеров (блогеров))", 1 },
                    { new Guid("6129f1da-3153-427d-9036-6b8dc4b93057"), "1.3.1.1", "Проведение мероприятий (тематические лекции, семинары, викторины, кинопоказы, театрализованные постановки, встречи с лидерами общественного мнения и т.п.), направленных на разъяснение преступной сущности ТЕРРОРИСТИЧЕСКИХ, УКРАИНСКИХ НАЦИОНАЛИСТИЧЕСКИХ И НЕОНАЦИСТСКИХ ОРГАНИЗАЦИЙ", 1 },
                    { new Guid("657dcfcd-34cc-42a0-be0a-e4b2e09c3915"), "1.1.1", "Проведение мероприятий, посвященных Дню защитника Отечества (23 февраля), Дню солидарности в борьбе с терроризмом (3 сентября), Дню Героев Отечества (9 декабря) с привлечением военнослужащих, сотрудников правоохранительных органов и гражданских лиц, участвовавших в борьбе с терроризмом, экспертов, журналистов, общественных деятелей, очевидцев террористических актов и пострадавших от действий террористов", 1 },
                    { new Guid("6d463e46-078d-4919-981f-1c2653c748c7"), "4.1.1", "Размещение в СМИ и сети Интернет: информационных материалов, освещающих организацию и проведение мероприятий, указанных в строках 1.1.1, 1.3.1- 1.3.3.1, 1.5.2 Плана; контента, нацеленного на формирование негативного отношения к терроризму, украинскому национализму и неонацизму, а также неприятие идей массовых убийств, разъяснение социальной значимости профилактической деятельности органов власти и популяризацию лиц, отличившихся в борьбе с терроризмом", 10 },
                    { new Guid("70c90777-eefb-4f1e-8663-a52ed7845370"), "1.5.1", "Проведение общественными организациями, волонтерскими, военно-патриотическими, молодежными и детскими объединениями (в т.ч. Всероссийским детско-юношеским военно-патриотическим общественным движением «Юнармия», общероссийским общественно-государственным движением детей и молодежи «Движение Первых» и др.), а также службами примирения (медиации) по разрешению конфликтных ситуаций) (далее – общественная организация) мероприятий, направленных на формирование антитеррористического мировоззрения у школьников и молодежи", 1 },
                    { new Guid("74df881f-f685-4ae4-829d-a6c4a946f491"), "1.5.2", "Поддержка социально-значимых (культурно-просветительских, гуманитарных, спортивных) проектов, направленных на привитие населению неприятия идеологии терроризма, насилия и негативных социальных явлений", 10 },
                    { new Guid("8105fbc8-b731-4eb5-a5d2-49dfb686c911"), "4.5", "Производство и распространение антитеррористических материалов (текстовых, графических, аудио и видео, в том числе в форме социальной рекламы) о нормах законодательства, устанавливающих уголовную ответственность за участие и содействие террористическим организациям, прежде всего за несообщение о преступлении террористической направленности, через региональные и местные средства массовой информации и популярные каналы в социальных сетях и мессенджерах", 5 },
                    { new Guid("859c9c05-660b-4600-bde2-fb6044abb08b"), "3.2.1", "Оказание социальной поддержки лицам, отбывшим наказание за участие в террористической деятельности", 2 },
                    { new Guid("86f416f8-6a8f-43b5-a77f-3d6ee48e1f9a"), "1.3.3.2", "Включение обучающихся и молодежи в организацию и проведение для своих сверстников мероприятий антитеррористической направленности", 10 },
                    { new Guid("8e8e8f09-6c64-4910-9e98-d4d18c013c0f"), "2.7.2", "Формирование антитеррористического мировоззрения у членов семей лиц, причастных к террористической деятельности (действующих, осужденных, нейтрализованных), в том числе детей, возвращенных из Сирийской Арабской Республики, Республики Ирак и Пакистана, привлечение их к волонтерской, военно-патриотической и иной социально полезной работе, общественно-политическим, воспитательным, просветительским, культурным, досуговым и спортивным мероприятиям, В ХОДЕ КОТОРОЙ РАЗЪЯСНЯТЬ ПРЕСТУПНУЮ СУЩНОСТЬ ТЕРРОРИСТИЧЕСКИХ И ИНЫХ РАДИКАЛЬНЫХ ОРГАНИЗАЦИЙ И ОТВЕТСТВЕННОСТЬ ЗА УЧАСТИЕ В ИХ ДЕЯТЕЛЬНОСТИ", 2 },
                    { new Guid("92ce9b0a-d0e9-47fd-98e1-ee2055f3fc1a"), "4.8", "Выявление в информационно-телекоммуникационной сети Интернет материалов, имеющих признаки террористической, экстремистской и иной деструктивной направленности (видео, фото, аудио, текстовых), в том числе путем внедрения современных средств мониторинга, совершенствования форм и алгоритмов передачи сведений о страницах, содержащих противоправный контент, в уполномоченные органы", 4 },
                    { new Guid("94329aca-ee0c-4e0d-9143-20279efacf58"), "1.3.3.1", "Создание тематических площадок, мероприятий, направленных на разъяснение школьникам и молодежи преступной сущности террористической, украинской националистической и неонацистской идеологии при проведении форумов и конференций с привлечением лидеров общественного мнения, общественных деятелей, вернувшихся из зон боевых действий военных корреспондентов, сотрудников правоохранительных органов, военнослужащих и добровольцев", 1 },
                    { new Guid("94a4f94a-b118-4c33-9359-6ea6904a6480"), "2.3", "Разъяснение иностранным гражданам, прибывшим в Российскую Федерацию для обучения, традиционных российских духовно-нравственных ценностей, норм законодательства Российской Федерации, устанавливающих ответственность за участие и содействие террористической деятельности, разжигание социальной, национальной и религиозной розни, а также о правилах поведения в российском обществе", 1 },
                    { new Guid("94d262e8-0e75-46c5-a023-4fb6d6253dca"), "2.7.1", "Интеграция в российское общество членов семей  лиц, причастных к террористической деятельности (действующих, осужденных, нейтрализованных), в том числе детей, возвращенных из Сирийской Арабской Республики, Республики Ирак и Пакистана, оказание им социальной, психологической и правовой помощи", 1 },
                    { new Guid("97b6be73-5934-4697-ae56-069e395d0b2c"), "3.4.1", "Выявление признаков подверженности радикализации обучающихся и студентов, в том числе несовершеннолетних получателей социальных услуг, деструктивным идеологиям, а также склонности к насильственному (агрессивному) и суицидальному поведению. Проведение психодиагностики обучающихся и студентов для определения лиц, склонных к суицидальному поведению, совершению насильственных действий или разделяющих деструктивную идеологию, испытывающих социально-бытовые проблемы и трудности в социализации в учебном коллективе (далее – лица, подверженные деструктивной идеологии), освоении учебных программ» (далее – психодиагностика)", 2 },
                    { new Guid("9a31d99c-8dc4-4e9a-a88e-298de02ff703"), "1.3.5", "Разработка и внедрение учебных, методических, информационно-разъяснительных и просветительских материалов (в установленной сфере деятельности) (далее – учебно-методические материалы) для использования в образовательном процессе и воспитательной работе с обучающимися образовательных организаций, прибывшими в автономный округ с территорий, ранее находившихся под контролем киевского режима", 5 },
                    { new Guid("9bcb70d7-e05b-4446-859c-afcba7d644a4"), "2.5", "Формирование антитеррористического мировоззрения у школьников и студентов, прибывающих из новых регионов Российской Федерации, их интеграция в учебные коллективы, привлечение к деятельности волонтерских движений, молодежных объединений (в т.ч. «Движение первых», «Юнармия»), студенческих структур (студенческие советы), в том числе культурно-досуговой направленности", 1 },
                    { new Guid("a1d8559f-d2bc-4d45-8400-26dd78737c8e"), "1.4", "Изъятие из библиотечных фондов изданий, содержащих информацию террористического, экстремистского и деструктивного характера, в том числе фальсифицирующую историю России на всех этапах ее становления и развития, дискредитирующую ее политику (далее – издания, содержащие материалы террористической направленности)", 4 },
                    { new Guid("a4cfdd39-a540-450a-8c38-80f37220f394"), "5.1.4", "Описание темы 5.1.4", 3 },
                    { new Guid("a6ecc0de-5742-4395-b780-1255a68ee150"), "1.3.1.2", "Правовое просвещение обучающихся в сфере противодействия идеологии терроризма, в том числе доведение информации об ответственности за совершение преступлений террористической направленности, с привлечением представителей правоохранительных и контрольно-надзорных органов автономного округа (Управление МВД России по автономному округу, преподавателей кафедр (дисциплин) юридического профиля)", 1 },
                    { new Guid("ab6a1797-2711-4b41-8575-f28f9e9e69ab"), "1.3.2", "Актуализация (конкретизация) учебно-методических материалов (рабочих программ учебных дисциплин, рекомендаций по подготовке и проведению занятий, планов занятий, учебных пособий, курсов лекций, фондов оценочных средств) в целях решения учебно-воспитательных задач по формированию стойкого неприятия идеологии терроризма", 2 },
                    { new Guid("be980040-62dc-413b-9123-13f27b321c73"), "3.6", "Доведение до лиц, получивших религиозное образование за рубежом и имеющих намерения заниматься религиозной деятельностью в автономном округе, положения законодательства Российской Федерации, устанавливающие ответственность за участие и содействие террористической деятельности, несообщение о преступлении, а также содержание традиционных российских духовно-нравственных ценностей", 2 },
                    { new Guid("ca236248-fbae-414e-9c78-6c8bff9624cb"), "4.6", "Трансляция выступлений лиц, отказавшихся от участия в террористической деятельности, прежде всего отбывших либо отбывающих наказание за совершение преступлений террористической направленности, в средствах массовой информации, в том числе в информационно-телекоммуникационной сети Интернет", 5 },
                    { new Guid("d0f5b489-3589-4cb3-be73-ee007190718a"), "3.2.3", "Ресоциализация и реинтеграция лиц, отбывших наказание за участие в террористической деятельности, в общество на основе их привлечения к профессиональной, общественной, волонтерской и иной социально-полезной деятельности", 0 },
                    { new Guid("d6429a39-9145-4a25-a4e0-d769bba9e756"), "4.2", "Создание и распространение студенческими медиа-центрами (культурными, радио, театральными студиями, Кибердружинами и др.) антитеррористического контента, в том числе с использованием страниц в социальных сетях и мессенджеров образовательных организаций среднего профессионального образования и высшего образования (с привлечением обучающихся)", 2 },
                    { new Guid("d8109905-dbca-4d7c-8e2e-1fe96ae37c7b"), "2.1", "Профилактическая работа с лицами, отбывающими наказание в учреждениях УИС, расположенных в автономном округе, в том числе: ознакомление осужденных со средствами наглядной агитации, печатными и аудиовизуальными материалами антитеррористического содержания; проведение с привлечением представителей социально ориентированных некоммерческих и религиозных организаций информационно-просветительских мероприятий для: доведения информации об ответственности за совершение преступлений террористической направленности; продвижения тезиса о бесперспективности совершения террористических актов, к которым подстрекают международные террористические и радикальные организации, украинские спецслужбы, националистические и неонацистские структуры; дискредитации с точки зрения общепринятых норм религии, морали, истории и законов логики террористической идеологии, типичного социального образа террориста, а также террористической деятельности лидеров и участников (сторонников) международных террористических и украинских радикальных организаций", 0 },
                    { new Guid("d8f93449-d87d-4238-9272-0864bb74e520"), "4.4", "Функционирование постоянно действующих выставочных экспозиций, посвященных землякам, которые проявили мужество и героизм, и активную гражданскую позицию в противостоянии с международными террористическими организациями, открытие памятников героям и включение данных памятных мест в экскурсионные программы", 1 },
                    { new Guid("e6043a39-71b8-49ac-b864-bd6810961c2f"), "2.8", "Формирование антитеррористического мировоззрения у молодежи, состоящей на различных видах учета, привлечение к волонтерской, военно-патриотической и иной социально-полезной активности, в т.ч. АНТИТЕРРОРИСТИЧЕСКОЙ НАПРАВЛЕННОСТИ, участие в общественно-политических, воспитательных, просветительских, культурных, досуговых и спортивных мероприятиях, в ходе которых разъяснять преступную сущность террористических и иных радикальных организаций и ответственность за участие в их деятельности", 10 },
                    { new Guid("e8747c71-8f01-43b3-93cf-136aaca514d9"), "1.1.3", "Участие в проекте «Парта героя»", 1 },
                    { new Guid("e884d4aa-9c03-46b0-bf0e-ed45fdb0bf32"), "3.4.3", "Выявление деструктивных проявлений на страницах в социальных сетях и мессенджерах лицами, подверженными деструктивной идеологии, в том числе с использованием ресурсов Центра информационной безопасности и психологической помощи молодежи автономного округа", 2 },
                    { new Guid("e9a37bed-5725-4e36-9274-77a814eb5e46"), "2.4", "Формирование антитеррористического мировоззрения у детей трудовых мигрантов, привитие им традиционных российских духовно-нравственных ценностей , адаптация в школьных коллективах (далее – мероприятия), а также профилактический охват во внеурочное время", 1 },
                    { new Guid("ef84d144-aeae-4b10-850f-9105aa75219a"), "3.3.1", "Проведение с лицами, отбывающими наказание за совершение преступлений террористической направленности, в том числе не связанное с лишением свободы, индивидуальных профилактических мероприятий, нацеленных на разъяснение преступной и античеловеческой сущности терроризма с привлечением психологов, представителей религиозных и общественных организаций", 0 },
                    { new Guid("f53701ec-d713-4575-aa11-db448ea30564"), "3.4.2", "Психолого-педагогическое сопровождение лиц, подверженных деструктивной идеологии, на основе результатов индивидуальных бесед, социально-психологического тестирования, социометрических исследований и иных форм психологической диагностики, педагогического наблюдения за изменениями в поведении обучающихся (в том числе связанных с социально-бытовыми проблемами и трудностями социализации в учебном коллективе, освоении образовательных программ), с привлечением кураторов из числа педагогического состава и студентов-наставников", 2 },
                    { new Guid("fbac5dfd-d38e-4356-8b5e-caa8894c2fa4"), "1.1.2", "Присвоение улицам, скверам, школам и т.д. имен Героев Российской Федерации, а также иных лиц, отличившихся в борьбе с терроризмом, прежде всего с украинскими националистическими и неонацистскими военизированными формированиями, признанными террористическими организациями", 1 },
                    { new Guid("ff6ab940-0b18-4aba-8147-bf7d96c667d1"), "2.2", "Разъяснительная работа среди иностранных граждан, прибывших в Российскую Федерацию для осуществления трудовой деятельности, о: нормах законодательства Российской Федерации, устанавливающих ответственность за участие и содействие террористической деятельности, способах сообщения органам власти, уполномоченным рассматривать сообщения о преступлениях, сведений об известных фактах подготовки либо совершения преступлений террористической направленности и лицах, к ним причастных, на площадках консультационных пунктов адаптации мигрантов муниципальных образований автономного округа, автономной некоммерческой организации «Центр социальной и культурной адаптации и интеграции иностранных граждан» (г. Сургут), Дома дружбы народов (гг. Ханты-Мансийск, Сургут)", 1 }
                });
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("0176009d-e13f-4230-b4af-42b5b040ec70"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("04e1b300-6327-4dd9-a713-d628b34a2a41"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("05433cb1-cbf1-4f67-9328-26e8f96eef07"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("0bc37a8e-ab7d-4b97-b898-4157b772993d"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("120fb6a7-d16d-4237-b547-96788609fbe7"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("2a21fea5-a310-4739-944c-f6515211768d"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("33da1420-da46-4361-bdbf-2b39f259efc3"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("3c40301b-1a29-4da0-9c89-f797d3cfe7da"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("3d01ec36-ed5a-4713-bdb1-517b61370df3"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("3f3af9e5-f945-4d05-87f8-6fcf18b9d04b"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("472de934-4c7a-43fc-a5e2-c4c73b8248db"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("474b23bf-309c-4dfb-985a-880aaeb521ce"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("4862344f-8d3e-43f4-a3d6-9e17f7485ee8"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("4ce53ec5-254b-4c95-8bee-366c352e23d2"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("535697ef-d5e9-40f4-b6d8-b9c8af92c583"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("585a30de-0d0f-48ee-94b5-1e887cf31b1a"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("5c4ebf6f-5cb8-43a0-87c5-294c302d0a35"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("6129f1da-3153-427d-9036-6b8dc4b93057"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("657dcfcd-34cc-42a0-be0a-e4b2e09c3915"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("6d463e46-078d-4919-981f-1c2653c748c7"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("70c90777-eefb-4f1e-8663-a52ed7845370"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("74df881f-f685-4ae4-829d-a6c4a946f491"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("8105fbc8-b731-4eb5-a5d2-49dfb686c911"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("859c9c05-660b-4600-bde2-fb6044abb08b"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("86f416f8-6a8f-43b5-a77f-3d6ee48e1f9a"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("8e8e8f09-6c64-4910-9e98-d4d18c013c0f"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("92ce9b0a-d0e9-47fd-98e1-ee2055f3fc1a"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("94329aca-ee0c-4e0d-9143-20279efacf58"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("94a4f94a-b118-4c33-9359-6ea6904a6480"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("94d262e8-0e75-46c5-a023-4fb6d6253dca"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("97b6be73-5934-4697-ae56-069e395d0b2c"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("9a31d99c-8dc4-4e9a-a88e-298de02ff703"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("9bcb70d7-e05b-4446-859c-afcba7d644a4"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("a1d8559f-d2bc-4d45-8400-26dd78737c8e"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("a4cfdd39-a540-450a-8c38-80f37220f394"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("a6ecc0de-5742-4395-b780-1255a68ee150"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("ab6a1797-2711-4b41-8575-f28f9e9e69ab"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("be980040-62dc-413b-9123-13f27b321c73"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("ca236248-fbae-414e-9c78-6c8bff9624cb"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("d0f5b489-3589-4cb3-be73-ee007190718a"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("d6429a39-9145-4a25-a4e0-d769bba9e756"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("d8109905-dbca-4d7c-8e2e-1fe96ae37c7b"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("d8f93449-d87d-4238-9272-0864bb74e520"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("e6043a39-71b8-49ac-b864-bd6810961c2f"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("e8747c71-8f01-43b3-93cf-136aaca514d9"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("e884d4aa-9c03-46b0-bf0e-ed45fdb0bf32"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("e9a37bed-5725-4e36-9274-77a814eb5e46"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("ef84d144-aeae-4b10-850f-9105aa75219a"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("f53701ec-d713-4575-aa11-db448ea30564"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("fbac5dfd-d38e-4356-8b5e-caa8894c2fa4"));

            migrationBuilder.DeleteData(
                table: "Themes",
                keyColumn: "Id",
                keyValue: new Guid("ff6ab940-0b18-4aba-8147-bf7d96c667d1"));

            migrationBuilder.DropColumn(
                name: "Role",
                table: "InterAgencyCooperations");

            migrationBuilder.AddColumn<int>(
                name: "Type",
                table: "InterAgencyCooperations",
                type: "integer",
                nullable: false,
                defaultValue: 0);

            migrationBuilder.InsertData(
                table: "Themes",
                columns: new[] { "Id", "Code", "Description", "Form" },
                values: new object[,]
                {
                    { new Guid("00a40677-d7a0-4b53-a064-142595074c5c"), "2.3", "Разъяснение иностранным гражданам, прибывшим в Российскую Федерацию для обучения, традиционных российских духовно-нравственных ценностей, норм законодательства Российской Федерации, устанавливающих ответственность за участие и содействие террористической деятельности, разжигание социальной, национальной и религиозной розни, а также о правилах поведения в российском обществе", 1 },
                    { new Guid("03e94dd6-2411-4ad5-83fb-f553031351c7"), "4.4", "Функционирование постоянно действующих выставочных экспозиций, посвященных землякам, которые проявили мужество и героизм, и активную гражданскую позицию в противостоянии с международными террористическими организациями, открытие памятников героям и включение данных памятных мест в экскурсионные программы", 1 },
                    { new Guid("0824d6ff-5211-43d6-9280-687429d0056f"), "5.1.2", "Описание темы 5.1.2", 0 },
                    { new Guid("0aca1e3f-50d4-4c01-a96a-f6ac326cdf8c"), "4.1.1", "Размещение в СМИ и сети Интернет: информационных материалов, освещающих организацию и проведение мероприятий, указанных в строках 1.1.1, 1.3.1- 1.3.3.1, 1.5.2 Плана; контента, нацеленного на формирование негативного отношения к терроризму, украинскому национализму и неонацизму, а также неприятие идей массовых убийств, разъяснение социальной значимости профилактической деятельности органов власти и популяризацию лиц, отличившихся в борьбе с терроризмом", 10 },
                    { new Guid("0b4ffa3a-fd7d-405c-8725-0c8110ee556f"), "3.2.3", "Ресоциализация и реинтеграция лиц, отбывших наказание за участие в террористической деятельности, в общество на основе их привлечения к профессиональной, общественной, волонтерской и иной социально-полезной деятельности", 0 },
                    { new Guid("1082e7e1-b00c-4f51-8a5f-2410a1e6d645"), "4.5", "Производство и распространение антитеррористических материалов (текстовых, графических, аудио и видео, в том числе в форме социальной рекламы) о нормах законодательства, устанавливающих уголовную ответственность за участие и содействие террористическим организациям, прежде всего за несообщение о преступлении террористической направленности, через региональные и местные средства массовой информации и популярные каналы в социальных сетях и мессенджерах", 5 },
                    { new Guid("14075b2f-391c-4922-9d4e-866720c88c36"), "5.3", "Описание темы 5.3", 2 },
                    { new Guid("1634caee-6481-466c-acb6-2b6b10933d47"), "2.5", "Формирование антитеррористического мировоззрения у школьников и студентов, прибывающих из новых регионов Российской Федерации, их интеграция в учебные коллективы, привлечение к деятельности волонтерских движений, молодежных объединений (в т.ч. «Движение первых», «Юнармия»), студенческих структур (студенческие советы), в том числе культурно-досуговой направленности", 1 },
                    { new Guid("1d9ee667-b6a6-4ed7-afa9-f1b8f814bfc0"), "1.3.5", "Разработка и внедрение учебных, методических, информационно-разъяснительных и просветительских материалов (в установленной сфере деятельности) (далее – учебно-методические материалы) для использования в образовательном процессе и воспитательной работе с обучающимися образовательных организаций, прибывшими в автономный округ с территорий, ранее находившихся под контролем киевского режима", 5 },
                    { new Guid("2b21a8d2-f546-4d9f-8e6d-7bc85d24887d"), "1.5.2", "Поддержка социально-значимых (культурно-просветительских, гуманитарных, спортивных) проектов, направленных на привитие населению неприятия идеологии терроризма, насилия и негативных социальных явлений", 10 },
                    { new Guid("2e27cd01-8bfd-47ce-99bb-6a6fcdfc2880"), "4.2", "Создание и распространение студенческими медиа-центрами (культурными, радио, театральными студиями, Кибердружинами и др.) антитеррористического контента, в том числе с использованием страниц в социальных сетях и мессенджеров образовательных организаций среднего профессионального образования и высшего образования (с привлечением обучающихся)", 2 },
                    { new Guid("311bcaab-cc06-4af6-b500-5c87ebdd661f"), "5.1.4", "Описание темы 5.1.4", 3 },
                    { new Guid("39c752e9-f6fe-49a8-8cdc-bed6754fb4d4"), "1.1.3", "Участие в проекте «Парта героя»", 1 },
                    { new Guid("3ee60fd7-8300-47b5-a431-cc24d308580b"), "2.2", "Разъяснительная работа среди иностранных граждан, прибывших в Российскую Федерацию для осуществления трудовой деятельности, о: нормах законодательства Российской Федерации, устанавливающих ответственность за участие и содействие террористической деятельности, способах сообщения органам власти, уполномоченным рассматривать сообщения о преступлениях, сведений об известных фактах подготовки либо совершения преступлений террористической направленности и лицах, к ним причастных, на площадках консультационных пунктов адаптации мигрантов муниципальных образований автономного округа, автономной некоммерческой организации «Центр социальной и культурной адаптации и интеграции иностранных граждан» (г. Сургут), Дома дружбы народов (гг. Ханты-Мансийск, Сургут)", 1 },
                    { new Guid("3fc868c4-047a-4440-9190-841a99fb7fd5"), "3.3.2", "Привлечение деятельно раскаявшихся и отказавшихся от участия в террористической деятельности лиц к проведению профилактической работы, включая создание антитеррористического контента", 0 },
                    { new Guid("445f9e4d-2268-41a9-9688-7b2e09c63b4b"), "1.3.1.2", "Правовое просвещение обучающихся в сфере противодействия идеологии терроризма, в том числе доведение информации об ответственности за совершение преступлений террористической направленности, с привлечением представителей правоохранительных и контрольно-надзорных органов автономного округа (Управление МВД России по автономному округу, преподавателей кафедр (дисциплин) юридического профиля)", 1 },
                    { new Guid("4bd2c26c-db5c-435f-aea4-f4d7db46b9d9"), "3.3.1", "Проведение с лицами, отбывающими наказание за совершение преступлений террористической направленности, в том числе не связанное с лишением свободы, индивидуальных профилактических мероприятий, нацеленных на разъяснение преступной и античеловеческой сущности терроризма с привлечением психологов, представителей религиозных и общественных организаций", 0 },
                    { new Guid("4d26271a-f367-48f8-b12f-5664378e9dbb"), "1.3.1.1", "Проведение мероприятий (тематические лекции, семинары, викторины, кинопоказы, театрализованные постановки, встречи с лидерами общественного мнения и т.п.), направленных на разъяснение преступной сущности ТЕРРОРИСТИЧЕСКИХ, УКРАИНСКИХ НАЦИОНАЛИСТИЧЕСКИХ И НЕОНАЦИСТСКИХ ОРГАНИЗАЦИЙ", 1 },
                    { new Guid("508c8221-0cf1-47a7-ae6a-dfa361f0ecdb"), "3.4.1", "Выявление признаков подверженности радикализации обучающихся и студентов, в том числе несовершеннолетних получателей социальных услуг, деструктивным идеологиям, а также склонности к насильственному (агрессивному) и суицидальному поведению. Проведение психодиагностики обучающихся и студентов для определения лиц, склонных к суицидальному поведению, совершению насильственных действий или разделяющих деструктивную идеологию, испытывающих социально-бытовые проблемы и трудности в социализации в учебном коллективе (далее – лица, подверженные деструктивной идеологии), освоении учебных программ» (далее – психодиагностика)", 2 },
                    { new Guid("516d654c-afc5-4558-afc0-92658fa6aa8f"), "5.2", "Проведение региональных и муниципальных обучающих мероприятий (конференции, форумы, семинары, «круглые столы», и др.) с последующим освещением их результатов на официальных сайтах, в социальных сетях и средствах массовой информации", 1 },
                    { new Guid("568d3452-7611-4995-a98a-09ee4b14c011"), "1.5.1", "Проведение общественными организациями, волонтерскими, военно-патриотическими, молодежными и детскими объединениями (в т.ч. Всероссийским детско-юношеским военно-патриотическим общественным движением «Юнармия», общероссийским общественно-государственным движением детей и молодежи «Движение Первых» и др.), а также службами примирения (медиации) по разрешению конфликтных ситуаций) (далее – общественная организация) мероприятий, направленных на формирование антитеррористического мировоззрения у школьников и молодежи", 1 },
                    { new Guid("5bdf4da1-731f-415c-8ce6-4f07d9397656"), "2.1", "Профилактическая работа с лицами, отбывающими наказание в учреждениях УИС, расположенных в автономном округе, в том числе: ознакомление осужденных со средствами наглядной агитации, печатными и аудиовизуальными материалами антитеррористического содержания; проведение с привлечением представителей социально ориентированных некоммерческих и религиозных организаций информационно-просветительских мероприятий для: доведения информации об ответственности за совершение преступлений террористической направленности; продвижения тезиса о бесперспективности совершения террористических актов, к которым подстрекают международные террористические и радикальные организации, украинские спецслужбы, националистические и неонацистские структуры; дискредитации с точки зрения общепринятых норм религии, морали, истории и законов логики террористической идеологии, типичного социального образа террориста, а также террористической деятельности лидеров и участников (сторонников) международных террористических и украинских радикальных организаций", 0 },
                    { new Guid("5e0708f7-2fb3-43c2-8c69-2d987cca64ce"), "2.7.1", "Интеграция в российское общество членов семей  лиц, причастных к террористической деятельности (действующих, осужденных, нейтрализованных), в том числе детей, возвращенных из Сирийской Арабской Республики, Республики Ирак и Пакистана, оказание им социальной, психологической и правовой помощи", 1 },
                    { new Guid("6a384820-be35-4759-bc31-6d52854a3e0f"), "5.6", "Оказание государственной и муниципальной поддержки некоммерческим, общественным организациям, деятельность которых направлена на привлечение обучающихся и молодежи, состоящей на различных формах учета, к реализации социально значимых, культурно-просветительских, гуманитарных, спортивных проектов, способствующих формированию антитеррористического мировоззрения", 1 },
                    { new Guid("6dbd50b7-8b71-4033-bace-0c898193538e"), "4.8", "Выявление в информационно-телекоммуникационной сети Интернет материалов, имеющих признаки террористической, экстремистской и иной деструктивной направленности (видео, фото, аудио, текстовых), в том числе путем внедрения современных средств мониторинга, совершенствования форм и алгоритмов передачи сведений о страницах, содержащих противоправный контент, в уполномоченные органы", 4 },
                    { new Guid("6f57905d-15fd-4245-80cb-27f67bfd9858"), "1.3.4", "Организация проведения студентами исследований и реализации творческих (художественных, театральных, журналистских, просветительских) проектов антитеррористического содержания (далее – проект), обеспечение участия их авторов в межвузовских, региональных и всероссийских конкурсах", 1 },
                    { new Guid("78472eda-0c92-4ba1-bcb2-12978a5866c7"), "1.3.3.1", "Создание тематических площадок, мероприятий, направленных на разъяснение школьникам и молодежи преступной сущности террористической, украинской националистической и неонацистской идеологии при проведении форумов и конференций с привлечением лидеров общественного мнения, общественных деятелей, вернувшихся из зон боевых действий военных корреспондентов, сотрудников правоохранительных органов, военнослужащих и добровольцев", 1 },
                    { new Guid("7a96ac16-46c9-49d8-9b96-c8186cd85c65"), "2.6", "Привлечение жителей новых субъектов Российской Федерации, прибывших в автономный округ, к волонтерской и иной социально полезной деятельности, в том числе антитеррористической направленности, способствующей привитию им традиционных российских духовно-нравственных ценностей", 1 },
                    { new Guid("7fd2e75c-c92e-4896-9cab-07c3e4cc2374"), "3.4.2", "Психолого-педагогическое сопровождение лиц, подверженных деструктивной идеологии, на основе результатов индивидуальных бесед, социально-психологического тестирования, социометрических исследований и иных форм психологической диагностики, педагогического наблюдения за изменениями в поведении обучающихся (в том числе связанных с социально-бытовыми проблемами и трудностями социализации в учебном коллективе, освоении образовательных программ), с привлечением кураторов из числа педагогического состава и студентов-наставников", 2 },
                    { new Guid("80d05323-db9b-46d3-aa89-c707978c4156"), "3.2.2", "Проведение мероприятий информационно-разъяснительного характера с лицами, отбывшими наказание за участие в террористической деятельности", 2 },
                    { new Guid("81a911e1-71b9-4b03-afb7-b1ab0f6f3b1a"), "3.1.1", "Проведение мероприятий по формированию антитеррористического мировоззрения среди лиц, осужденных за совершение преступлений террористической направленности", 0 },
                    { new Guid("881365a9-a9c2-49da-831e-467bcdb27fa2"), "4.1.3", "Создание и обеспечение функционирования электронного каталога антитеррористических материалов (текстовых, графических, аудио и видео) с предоставлением к нему свободного доступа прежде всего для использования при проведении общепрофилактических, адресных, индивидуальных и информационно-пропагандистских мероприятий", 1 },
                    { new Guid("88d8e4cb-3917-4b63-ab47-4f091b2dc923"), "3.5", "Индивидуальные профилактические мероприятия в отношении подростков и детей, в том числе с признаками травмированной психики, находившихся под влиянием украинских националистических и неонацистских структур, а также проявляющих в социальных сетях и мессенджерах активный интерес к террористическому и деструктивному контенту радикальной, насильственной и суицидальной направленности", 2 },
                    { new Guid("8ac16832-534f-4b02-b64d-3a0145de24cd"), "1.6", "Анализ психологического климата в образовательных организациях, активности виртуальных деструктивных сообществ, динамики насильственных проявлений среди несовершеннолетних, по результатам которых: принимать меры, направленные на повышение качества организации и реализации воспитательных и профилактических мероприятий в конкретной образовательной организации, в том числе с привлечением учреждений молодежной политики, культуры и спорта; информировать Аппарат АТК автономного округа о принятых мерах", 0 },
                    { new Guid("8bd402ce-9e0a-4f36-8b6e-f0c9532a8774"), "2.4", "Формирование антитеррористического мировоззрения у детей трудовых мигрантов, привитие им традиционных российских духовно-нравственных ценностей , адаптация в школьных коллективах (далее – мероприятия), а также профилактический охват во внеурочное время", 1 },
                    { new Guid("944a8a7d-c9f1-45fe-b735-1bc366fea30c"), "3.4.3", "Выявление деструктивных проявлений на страницах в социальных сетях и мессенджерах лицами, подверженными деструктивной идеологии, в том числе с использованием ресурсов Центра информационной безопасности и психологической помощи молодежи автономного округа", 2 },
                    { new Guid("a42ad712-a24f-4bc3-9c50-c66d0ac53840"), "3.1.2", "Привлечение психологов, членов семей, представителей общественных и религиозных организаций к проведению с лицами, осужденными за совершение преступлений террористической направленности, информационно-просветительских и воспитательных мероприятий по разъяснению традиционных российских духовно-нравственных ценностей, общественной опасности терроризма, бесперспективности террористических методов борьбы, правовой и моральной ответственности за участие в деятельности террористических организаций", 0 },
                    { new Guid("a5629e19-8055-49aa-acbe-17d139bd88ca"), "1.2.1", "Проведение общественно-политических, воспитательных, просветительских, культурных, досуговых и спортивных мероприятий (круглые столы, акции памяти, встречи с лицами, отличившимися в борьбе с терроризмом и неонацизмом, профилактические беседы, кинопоказы, выставки, тематические викторины, спортивные турниры и др.) (далее – мероприятия), в содержание которых включена антитеррористическая тематика, с привлечением лидеров общественного мнения , общественных деятелей, представителей традиционных религиозных конфессий, общественных и социально ориентированных некоммерческих организаций, детских и молодежных движений (обществ, проектов)", 1 },
                    { new Guid("a852b374-1140-49f9-af96-062951be3591"), "3.2.1", "Оказание социальной поддержки лицам, отбывшим наказание за участие в террористической деятельности", 2 },
                    { new Guid("aa15b307-248c-4822-bd5f-bab3de217bca"), "2.8", "Формирование антитеррористического мировоззрения у молодежи, состоящей на различных видах учета, привлечение к волонтерской, военно-патриотической и иной социально-полезной активности, в т.ч. АНТИТЕРРОРИСТИЧЕСКОЙ НАПРАВЛЕННОСТИ, участие в общественно-политических, воспитательных, просветительских, культурных, досуговых и спортивных мероприятиях, в ходе которых разъяснять преступную сущность террористических и иных радикальных организаций и ответственность за участие в их деятельности", 10 },
                    { new Guid("aad95e2a-0836-4d3b-a648-03a313554b21"), "4.3", "Оказание в условиях государственной (грантовой) поддержки проектов создания материалов, нацеленных на формирование у жителей автономного округа антитеррористического мировоззрения (теле- и радиопередач, игровых и неигровых фильмов, театральных постановок, выставок, буклетов, книжных изданий), распространяемых по наиболее популярным у населения, прежде всего молодежи, информационным каналам (с привлечением региональных и местных средств массовой информации, социально ориентированных некоммерческих организаций, религиозных и общественных организаций, продюсерских центров, творческих объединений и киностудий, администраторов популярных каналов в социальных сетях и мессенджеров (блогеров))", 1 },
                    { new Guid("b093d3c8-f35e-42ee-a894-f0725ca1b1a1"), "1.1.1", "Проведение мероприятий, посвященных Дню защитника Отечества (23 февраля), Дню солидарности в борьбе с терроризмом (3 сентября), Дню Героев Отечества (9 декабря) с привлечением военнослужащих, сотрудников правоохранительных органов и гражданских лиц, участвовавших в борьбе с терроризмом, экспертов, журналистов, общественных деятелей, очевидцев террористических актов и пострадавших от действий террористов", 1 },
                    { new Guid("b8f3a363-bce8-49bc-89ca-272ea01260d3"), "1.3.2", "Актуализация (конкретизация) учебно-методических материалов (рабочих программ учебных дисциплин, рекомендаций по подготовке и проведению занятий, планов занятий, учебных пособий, курсов лекций, фондов оценочных средств) в целях решения учебно-воспитательных задач по формированию стойкого неприятия идеологии терроризма", 2 },
                    { new Guid("c51b70c3-5ad9-4100-b74e-f0e50c14cd68"), "3.6", "Доведение до лиц, получивших религиозное образование за рубежом и имеющих намерения заниматься религиозной деятельностью в автономном округе, положения законодательства Российской Федерации, устанавливающие ответственность за участие и содействие террористической деятельности, несообщение о преступлении, а также содержание традиционных российских духовно-нравственных ценностей", 2 },
                    { new Guid("ca86782e-8488-4943-87af-f0e661325032"), "1.4", "Изъятие из библиотечных фондов изданий, содержащих информацию террористического, экстремистского и деструктивного характера, в том числе фальсифицирующую историю России на всех этапах ее становления и развития, дискредитирующую ее политику (далее – издания, содержащие материалы террористической направленности)", 4 },
                    { new Guid("dda72c7e-8c48-4569-a256-cce8b18f5032"), "4.6", "Трансляция выступлений лиц, отказавшихся от участия в террористической деятельности, прежде всего отбывших либо отбывающих наказание за совершение преступлений террористической направленности, в средствах массовой информации, в том числе в информационно-телекоммуникационной сети Интернет", 5 },
                    { new Guid("e144b255-58b6-471c-b553-ebf9c39568e8"), "5.1.3", "Описание темы 5.1.3", 0 },
                    { new Guid("e34472ee-3b48-4e7f-8523-5981704d0a03"), "1.1.2", "Присвоение улицам, скверам, школам и т.д. имен Героев Российской Федерации, а также иных лиц, отличившихся в борьбе с терроризмом, прежде всего с украинскими националистическими и неонацистскими военизированными формированиями, признанными террористическими организациями", 1 },
                    { new Guid("f1f68ffe-435e-4ded-90e1-b9646bdf88a1"), "2.7.2", "Формирование антитеррористического мировоззрения у членов семей лиц, причастных к террористической деятельности (действующих, осужденных, нейтрализованных), в том числе детей, возвращенных из Сирийской Арабской Республики, Республики Ирак и Пакистана, привлечение их к волонтерской, военно-патриотической и иной социально полезной работе, общественно-политическим, воспитательным, просветительским, культурным, досуговым и спортивным мероприятиям, В ХОДЕ КОТОРОЙ РАЗЪЯСНЯТЬ ПРЕСТУПНУЮ СУЩНОСТЬ ТЕРРОРИСТИЧЕСКИХ И ИНЫХ РАДИКАЛЬНЫХ ОРГАНИЗАЦИЙ И ОТВЕТСТВЕННОСТЬ ЗА УЧАСТИЕ В ИХ ДЕЯТЕЛЬНОСТИ", 2 },
                    { new Guid("f75a22fc-809a-4eb3-bdbc-4c34b1fc202e"), "1.3.3.2", "Включение обучающихся и молодежи в организацию и проведение для своих сверстников мероприятий антитеррористической направленности", 10 },
                    { new Guid("fe010915-4641-4e75-8b50-67926468cd43"), "4.7", "Подготовка и распространение тематических материалов, разъясняющих несостоятельность доводов и фактов, оправдывающих террористическую деятельность, совершаемую украинскими националистами, неонацистами и их пособниками", 5 }
                });
        }
    }
}
